share/tutorials/incompressible/pimple/tjunction_fan/0.org/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}

dimensions      [m s^-1];
internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
    type            pressureInletOutletVelocity;
    value           uniform (0 0 0);
  }
  outlet1
  {
    type            inletOutlet;
    inletValue      uniform (0 0 0);
    value           uniform (0 0 0);
  }
  outlet2
  {
    type            inletOutlet;
    inletValue      uniform (0 0 0);
    value           uniform (0 0 0);
  }
  defaultFaces
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
