share/tutorials/incompressible/pimple/tjunction_fan/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [m^2 s^-2];
internalField   uniform 0.375;

boundaryField
{
  inlet
  {
    type            turbulentIntensityKineticEnergyInlet;
    intensity       0.05;
    value           uniform 0.375;
  }
  outlet1
  {
    type            inletOutlet;
    inletValue      uniform 0.375;
    value           uniform 0.375;
  }
  outlet2
  {
    type            inletOutlet;
    inletValue      uniform 0.375;
    value           uniform 0.375;
  }
  defaultFaces
  {
    type            kqRWallFunction;
    value           uniform 0.375;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
