share/tutorials/incompressible/pimple/tjunction_fan/0.org/nuTilda
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nuTilda;
}

dimensions      [m^2 s^-1];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet1
  {
    type            zeroGradient;
  }
  outlet2
  {
    type            zeroGradient;
  }
  defaultFaces
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
