share/tutorials/incompressible/pimple/tjunction_fan/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

//           outlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           outlet2
convertToMeters 1;
vertices
(
  (0.0  -0.01 0)   //0
  (0.2  -0.01 0)
  (0.2   0.01 0)   //2
  (0.0   0.01 0)
  (0.22 -0.01 0)  //4
  (0.22  0.01 0)
  (0.2  -0.21 0)  //6
  (0.22 -0.21 0)
  (0.2   0.21 0)  //8
  (0.22  0.21 0)
  // Z
  (0.0  -0.01 0.02)   //0
  (0.2  -0.01 0.02)
  (0.2   0.01 0.02)   //2
  (0.0   0.01 0.02)
  (0.22 -0.01 0.02)  //4
  (0.22  0.01 0.02)
  (0.2  -0.21 0.02)  //6
  (0.22 -0.21 0.02)
  (0.2   0.21 0.02)  //8
  (0.22  0.21 0.02)
);
blocks
(
  // inlet block
  hex (0 1 2 3  10 11 12 13) (50 5 5) simpleGrading (1 1 1)
  // central block
  hex (1 4 5 2  11 14 15 12) (5 5 5) simpleGrading (1 1 1)
  // bottom block
  hex (6 7 4 1  16 17 14 11) (5 50 5) simpleGrading (1 1 1)
  // top block
  hex (2 5 9 8  12 15 19 18) (5 50 5) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  inlet
  {
    type patch;
    faces  ((0 10 13 3));
  }
  outlet1
  {
    type patch;
    faces ((6 7 17 16));
  }
  outlet2
  {
    type patch;
    faces ((8 18 19 9));
  }
  defaultFaces
  {
    type wall;
    faces ();
  }
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
